tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew tap zackelia/formulae
brew "ansible"
brew "direnv"
brew "eza"
brew "fd"
brew "gitleaks"
brew "pre-commit"
brew "sops"
brew "age"
brew "zsh-autosuggestions"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "rsync"
brew "grep"
brew "starship"
brew "bclm"
brew "kubectl"
brew "helm"
brew "httpd"
brew "kompose"
brew "jq"
brew "node"
brew "derailed/k9s/k9s"
brew "tree"
brew "1password-cli"
cask "font-monaspace"
cask "font-fira-code-nerd-font"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "teabyii.ayu"
vscode "vue.volar"
